<template>
  <div class="index-page">
    <base-seo-text>
      <p>Откройте для себя наше разнообразное меню в NamiSushi и насладитесь неповторимым вкусом Японии в каждом блюде. Мы предлагаем широкий выбор роллов, нигири и сашими, чтобы удовлетворить самые изысканные вкусовые предпочтения.</p>
      <p>Искушайтесь нашими классическими роллами, предлагающими знакомые и неповторимые комбинации ингредиентов. Погрузитесь в мир вкуса с нашими авторскими роллами, разработанными нашими талантливыми шеф-поварами. Для тех, кто предпочитает растительную пищу, у нас также имеются вегетарианские роллы, гарантирующие насыщенный и вкусный опыт.</p>
      <p>Насладитесь изысканностью нигири и сашими, предлагающих свежие и качественные ингредиенты. Выберите свои предпочтения и позвольте нам удивить вас вниманием к деталям и прекрасным вкусом каждого кусочка.</p>
      <p>Приходите к нам и ощутите атмосферу Японии, наслаждаясь нашим разнообразным меню. Мы гарантируем высокое качество каждого блюда и быструю доставку, чтобы вы могли наслаждаться вкусом Японии прямо у себя дома или в офисе.</p>
      <p>Закажите сейчас и погрузитесь в незабываемый вкусовой опыт с NamiSushi. Мы рады стать вашим источником изысканного японского вкуса в городе Донецк и Макеевка.</p>
    </base-seo-text>
    <banner/>
    <app-menu id="menu"/>
  </div>
</template>

<script>
import Banner from "@/components/pages/indexPage/banner/Banner";
import AppMenu from "@/components/pages/indexPage/menu/AppMenu";
import BaseSeoText from "@/components/common/BaseSeoText";

export default {
  name: 'index-page',
  components: { Banner, AppMenu, BaseSeoText },
  head: {
    title: `Онлайн заказ суши в Донецке - Быстрая доставка свежих и вкусных роллов | NamiSushi`,
    meta: [
      {
        hid: 'description',
        name: 'description',
        content: 'NamiSushi предлагает онлайн заказ суши в Донецке и Макеевке. У нас вы можете насладиться широким ассортиментом свежих и вкусных японских роллов, нигири и сашими. Мы гарантируем быструю доставку и высокое качество каждого блюда. Оформите заказ прямо сейчас и насладитесь изысканными вкусами NamiSushi!'
      }
    ]
  },
  beforeDestroy() {
    this.$store.commit('setIsMenu', false)
  }
}
</script>

<style lang="scss" scoped>
.index-page {
  width: 100vw;
  max-width: 100%;
}
</style>
